// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет


Console.Clear();
Console.WriteLine("Автор: Новиков ВВ");
Console.WriteLine("-----------------");
Console.Write("Введите номер дня недели: ");
int num = Convert.ToInt32(Console.ReadLine());

bool weekend(int num1)
{
    return ();
}

bool result = square(a, b);







// if (num => 6)
// {
//     Console.WriteLine($"Выходной день");
// }
// else Console.WriteLine($"Будний день");